"""
4. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""
us_input = input("Введите несколько слов, разделенных пробелами >>> ").split(" ")

for ind, el in enumerate(us_input):
    print(f"{ind+1} >>> {el[:10]}")