"""
5. Реализовать структуру «Рейтинг», представляющую собой не
возрастающий набор натуральных чисел
(каждый элемент ряда меньше или равен предыдущему).

У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.

Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.

Набор натуральных чисел можно задать непосредственно в коде,
например, my_list = [7, 5, 3, 3, 2].
"""

my_list = [7, 5, 3, 3, 2]
position = 0

e = int(input("Введите элемент рейтинга: "))

for i in my_list:
    if i < e:
        my_list.insert(position, e)
        print(f"Пользователь ввёл число {e}. Результат: {my_list}")
        break
    else:
        position += 1
        if position == len(my_list):
            my_list.append(e)
            print(f"Пользователь ввёл число {e}. Результат: {my_list}")
            break
