"""
Задание 2. Для списка реализовать обмен значений соседних элементов,
т.е. значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
При нечетном количестве элементов последний сохранить на своем месте.
Для заполнения списка элементов необходимо использовать функцию input().

Пример:
Введите целые числа через пробел: 1 2 3 4
Результат: 2 1 4 3

Введите целые числа через пробел: 1 2 3
Результат: 2 1 3
"""

arr = list(input('input through space positive integer: ').split(' '))
ind = 0
while ind < len(arr) - 1:
    arr[ind], arr[ind + 1] = arr[ind + 1], arr[ind]
    ind += 2
print(arr)
