"""
5. Реализовать структуру «Рейтинг», представляющую собой не
возрастающий набор натуральных чисел
(каждый элемент ряда меньше или равен предыдущему).

У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.

Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.

Набор натуральных чисел можно задать непосредственно в коде,
например, my_list = [7, 5, 3, 3, 2].
"""
my_list = [7, 5, 3, 3, 2]
while True:
    value = input("Введите число:")
    if value == '':
        print("Выход из программы. Окончательный массив:", my_list)
        exit(0)
    num = int(value)
    j = 0
    is_done = False
    for item in my_list:
        if num > item:
            my_list.insert(j, num)
            is_done = True
        j += 1
        if is_done:
            break
    if not is_done:
        my_list.append(num)
    print(my_list)



