"""
Задание 1. Создать список и заполнить его элементами различных типов данных.
Реализовать проверку типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя,
а указать явно, в программе.

Пример:
для списка [5, "string", 0.15, True, None]
результат

<class 'int'>
<class 'str'>
<class 'float'>
<class 'bool'>
<class 'NoneType'>
"""

datatypes = [10, "word", 5.55, False, None]
for i in range(len(datatypes)):
    print(f'{i}-ой элемент списка = "{datatypes[i]}" и имеет тип {type(datatypes[i])}')
