"""
4. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове.

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""

my_str = input("Введите слова через пробел: ")
list_str = my_str.split()
list_index = 0
for n in list_str:
    list_index += 1
    print(f"{list_index}. {n[:10]}")
