"""
6. *Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

Пример готовой структуры:
[
    (1, {"название": "компьютер", "цена": 20000, "количество": 5, "eд": "шт."}),
    (2, {"название": "принтер", "цена": 6000, "количество": 2, "eд": "шт."}),
    (3, {"название": "сканер", "цена": 2000, "количество": 7, "eд": "шт."})
]

Далее необходимо собрать аналитику о товарах. Реализовать словарь,
в котором каждый ключ — характеристика товара, например название,
а значение — список значений-характеристик, например список названий товаров.

Пример:

{
"названия": ["компьютер", "принтер", "сканер"],
"цены": [20000, 6000, 2000],
"количества": [5, 2, 7],
"ед": ["шт."]
}
"""
goods = [
    (1, {"название": "компьютер", "цена": 20000, "количество": 5, "eд": "шт."}),
    (2, {"название": "принтер", "цена": 6000, "количество": 2, "eд": "шт."}),
    (3, {"название": "сканер", "цена": 2000, "количество": 7, "eд": "шт."})
]
result_dict = {}
result_list_name = []
result_list_price = []
result_list_quant = []
result_list_units = []
for el in goods:
    for key, value in el[1].items():
        if key == "название":
            result_list_name.append(value)
            result_dict.update({key: result_list_name})
        elif key == "цена":
            result_list_price.append(value)
            result_dict.update({key: result_list_price})
        elif key == "количество":
            result_list_quant.append(value)
            result_dict.update({key: result_list_quant})
        else:
            result_list_units.append(value)
            result_dict.update({key: set(result_list_units)})
print(result_dict)
