"""
4. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове.

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""
pool = input('Введите несколько слов через пробел:').split()
for n, bl in enumerate(pool):
        print(f"{n + 1}. {bl if len(bl) < 10 else bl[:10]}")

