"""
4. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове.

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""

user_str = input('Введите слова через пробел: ')
user_list = user_str.split(' ')

count = 0

for i in user_list:
    count += 1

    print(f'{count}. {i[0:10]}')


