month = {"1": "Январь", "2": "Февраль", "3": "Март", "4": "Апрель", "5": "Май", "6": "Июнь", "7": "Июль", "8": "Август", "9": "Сентябрь", "10": "Октябрь", "11": "Ноябрь", "12": "Декабрь"}

winter = ["Декабрь", "Январь", "Февраль"]
spring = ["Март", "Апрель", "Май"]
summer = ["Июнь", "Июль", "Август"]
autumn = ["Сентябрь", "Октябрь", "Ноябрь"]

number = month[input("Введите месяц в числовом формате: ")]
if winter.count(number) > 0:
    print("Время года - зима")
elif spring.count(number) > 0:
    print("Время года - весна")
elif summer.count(number) > 0:
    print("Время года - лето")
elif autumn.count(number) > 0:
    print("Время года - осень")

