"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите два варианта решения: через list и через dict.

Пример:
Введите номер месяца: 10
Результат через список: Осень
Результат через словарь: Осень
"""

import sys

month = int(input("Введите номер месяца: "))
if month < 1 or month > 12:
    print("Неправильный номер месяца! Введите значение от 1 до 12.")
    sys.exit(1)

seasons_list = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето",
                "Лето", "Осень", "Осень", "Осень", "Зима"]
print(f"Результат через список: {seasons_list[month - 1]}")

seasons_list = ["Зима", "Весна", "Лето", "Осень", "Зима"]
index = month // 3
print(f"Результат через список: {seasons_list[index]}")

seasons_map = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна",
               6: "Лето", 7: "Лето", 8: "Лето",  9: "Осень",
               10: "Осень", 11: "Осень", 12: "Зима"}
print(f"Результат через словарь: {seasons_map[month]}")

seasons_map = {"Зима": (1, 2, 12), "Весна": (3, 4, 5), "Лето": (6, 7, 8),
               "Осень": (9, 10, 11)}
for key, value in seasons_map.items():
    try:
        if value.index(month) != -1:
            print(f"Результат через словарь: {key}")
            break
    except ValueError:
        continue
