a = int(input("ведите значение"))
list1 = ["Зима", "Весна", "Лето", "Осень"]

if 1 <= a <= 12:
    if 1 <= a <= 2:
        print(list1[0])
    elif 3 <= a <= 5:
        print(list1[1])
    elif 6 <= a <= 8:
        print(list1[2])
    elif 9 <= a <= 11:
        print(list1[3])
    elif 12 == a:
        print(list1[0])
else:
    print("Такого месяца нет")
# Через лист

a = int(input("ведите значение"))
list1 = {1: "Зима", 2: "Весна", 3: "Лето", 4: "Осень"}

if 1 <= a <= 12:
    if 1 <= a <= 2:
        print(list1[1])
    elif 3 <= a <= 5:
        print(list1[2])
    elif 6 <= a <= 8:
        print(list1[3])
    elif 9 <= a <= 11:
        print(list1[4])
    elif 12 == a:
        print(list1[1])
else:
    print("Такого месяца нет")
# через dict

"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите два варианта решения: через list и через dict.

Пример:
Введите номер месяца: 10
Результат через список: Осень
Результат через словарь: Осень
"""
