"""
4. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове.

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""

str0 = input("Введите слова через пробел: ")
split_str0 = str0.split()
c = 1

for i in split_str0:
    print(f"{c}. {i[0:10]}")
    c += 1
