"""
Задание 2. Для списка реализовать обмен значений соседних элементов,
т.е. значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
При нечетном количестве элементов последний сохранить на своем месте.
Для заполнения списка элементов необходимо использовать функцию input().

Пример:
Введите целые числа через пробел: 1 2 3 4
Результат: 2 1 4 3

Введите целые числа через пробел: 1 2 3
Результат: 2 1 3
"""
digit = input('Enter digi: ')
a = [int(i) for i in digit.split()]
for i in range(1, len(a), 2):
    a[i-1], a[i] = a[i], a[i-1]
print(' '.join([str(i) for i in a]))

