"""
Задание 1. Создать список и заполнить его элементами различных типов данных.
Реализовать проверку типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя,
а указать явно, в программе.

Пример:
для списка [5, "string", 0.15, True, None]
результат

<class 'int'>
<class 'str'>
<class 'float'>
<class 'bool'>
<class 'NoneType'>
"""

my_list = [123, 'text', True, None, 3.14, [1, 'sample'], ('tuple', True), {1, 'set'}, {'this_dict': True, 'key_2': 2}]

for el in my_list:
    print(type(el))
