"""
5. Реализовать структуру «Рейтинг», представляющую собой не
возрастающий набор натуральных чисел
(каждый элемент ряда меньше или равен предыдущему).

У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.

Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.

Набор натуральных чисел можно задать непосредственно в коде,
например, my_list = [7, 5, 3, 3, 2].
"""
my_list = [7, 5, 3, 3, 2]
user_num = int(input("Введите элемент рейтинга: "))
element_pos = 0
insert_element_pos = 0

while element_pos <= len(my_list) - 1:
    if user_num > my_list[element_pos]:
        insert_element_pos = element_pos
        break
    else:
        insert_element_pos = element_pos + 1
    element_pos += 1

my_list.insert(insert_element_pos, user_num)
print(my_list)
