"""
6. *Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

Пример готовой структуры:
[
    (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
    (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
    (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]

Далее необходимо собрать аналитику о товарах. Реализовать словарь,
в котором каждый ключ — характеристика товара, например название,
а значение — список значений-характеристик, например список названий товаров.

Пример:

{
“названия”: [“компьютер”, “принтер”, “сканер”],
“цены”: [20000, 6000, 2000],
“количества”: [5, 2, 7],
“ед”: [“шт.”]
}
"""


my_lst = []
while True:
    my+lst.append((input("Number of an item"),
                   {"Name": input("Name"),
                    "Price": input("Price"),
                    "Amount": input"Amount"),
                    "Unit": input("Unit")}))
    q = input("End? y or n")
    if q == "y":
        break


my_lst = [(1, {"Name": "PC", "Price": 20000, "Amount": 5, "Unit": "p."}),
          (2, {"Name": "Printer", "Price": 6000, "Amount": 2, "Unit": "p."}),
          (3, {"Name": "Scanner", "Price": 2000, "Amount": 7, "Unit": "p."})]


names_lst = []
prices_lst = []
counts_lst = []
units_lst = []
res_dict = {}
for i in range(len(my_lst)):
    names_lst.append(my_lst[i][1]["Name"])
    prices_lst.append(my_lst[i][1]["Price"])
    counts_lst.append(my_lst[i][1]["Amount"])
    units_lst.append(my_lst[i][1]["Unit"])
    
    
res_dict.update({"Names": names_lst, "Prices": prices_lst, "Amounts": counts_lst, "Units": units_lst})
print(res_dict)
