list1 = [5, "string", 0.15, True, None]
a = list1[0]
print(type(a))
b = list1[1]
print(type(b))
c = list1[2]
print(type(c))
d = list1[3]
print(type(d))
e = list1[4]
print(type(e))

"""
Задание 1. Создать список и заполнить его элементами различных типов данных.
Реализовать проверку типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя,
а указать явно, в программе.

Пример:
для списка [5, "string", 0.15, True, None]
результат

<class 'int'>
<class 'str'>
<class 'float'>
<class 'bool'>
<class 'NoneType'>
"""
