"""
4. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове.

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""
w = input("Введите слова через пробел:").split()
l = len(w)

for i, w in enumerate(w, 1):
    if l > 10:
        w = w[:10]
    print(f"{i}. {w}")
