month = int(input("Введите месяц с 1 по 12:"))
if month < 13:
    my_lst = [
        "Зима",
        "Зима",
        "Весна",
        "Весна",
        "Весна",
        "Лето",
        "Лето",
        "Лето",
        "Осень",
        "Осень",
        "Осень",
        "Зима", ]
    print(f'Итог через список: {my_lst[month - 1]}')
    my_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето",
               9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима", }
    print(f'Итог по словарю: {my_dict.get(month)}')
elif month >= 13:
    print('Некоррекный ввод данных')
