"""
6. Реализовать функцию int_func(), принимающую слово из маленьких
латинских букв и возвращающую его же, но с прописной первой буквой.
Например, print(int_func(‘text’)) -> Text.

Продолжить работу над заданием. В программу должна попадать строка из слов,
разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
Необходимо использовать написанную ранее функцию int_func().
"""
def up_first_symbol(my_str: str):
    word_list = []
    for word in my_str.split(' '):
        word_list.append(word.capitalize())
    return (' ').join(word_list)

inp = input('Введите строку: ')
print(up_first_symbol(inp))