"""
Задание 2.

Реализовать класс Road (дорога), в котором определить защищенные атрибуты:
length (длина в метрах), width (ширина в метрах).

Значения данных атрибутов должны передаваться при создании экземпляра класса.

Реализовать публичный метод расчета массы асфальта, необходимого для покрытия
всего дорожного полотна.

Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв.
метра дороги асфальтом, толщиной в 1 см * числом толщины полотна.
Массу и толщину сделать публичными атрибутами.
Проверить работу метода.

Например: 20м*5000м*25кг*0.05м = 125000 кг = 125 т
"""


class Road:

    def asphalt(self, __length, __width, weight=25, thickness=0.05):
        result = __length * __width * weight * thickness
        return result


calculation = Road()
print(f"Необходимая масса асфальта = {calculation.asphalt(20, 5000)} кг = {calculation.asphalt(20, 5000) / 1000} т")

