"""
6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.

Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.

Например, в первом задании выводим целые числа, начиная с 3,
а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие,
при котором повторение элементов списка будет прекращено.
"""

"""
Выполенине! Емельяненко А.А.
"""

from itertools import count, cycle

for a in count(2):
    if a == 1003:
        break
    print(a)

user_cycle = cycle(['37', '22', 4, 55, {'56': 2}])
for a in range(5):
    print(next(user_cycle))
