"""
6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.

Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.

Например, в первом задании выводим целые числа, начиная с 3,
а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие,
при котором повторение элементов списка будет прекращено.
"""

from sys import argv
from itertools import count
from itertools import cycle


script_name, number = argv

# а) итератор, генерирующий целые числа, начиная с указанного,
for el in count(int(number)):
    if el > 10:
        break
    else:
        print(el)

# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
c = 1
for el in cycle(number):
    if c > len(number):
        break
    print(el)
    c += 1
