"""
6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.

Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.

Например, в первом задании выводим целые числа, начиная с 3,
а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие,
при котором повторение элементов списка будет прекращено.
"""
from itertools import count
from itertools import cycle
from sys import argv
# a)
script_name, num = argv
for i in count(int(num)):
    if i > 10:
        break
    else:
        print(i)
# b)
list_1 = [1, 2, 3, 4, 5]
x = 1
rep = cycle(list_1)
for j in rep:
    print(j)
    if x > 10:
        break
    x += 1