"""
5. Реализовать формирование списка, используя функцию range()
и возможности генераторного выражения.
В список должны войти четные числа от 100 до 1000 (включая границы).
Необходимо получить результат вычисления произведения всех элементов списка.
Подсказка: использовать лямбда-функцию и функцию reduce().
"""
from functools import reduce
list_2 = [x for x in range(100,1001) if x % 2 == 0]
p = reduce((lambda x, y: x * y), list_2)
print(p)