"""
1. Реализовать скрипт, в котором должна быть предусмотрена функция
расчета заработной платы сотрудника. В расчете необходимо использовать формулу:
(выработка в часах*ставка в час) + премия.

Для выполнения расчета для конкретных значений
необходимо запускать скрипт с параметрами.
"""
import sys

*_, hours, rate, bonus = sys.argv

salary = (float(rate) * float(hours)) + float(bonus)

print(f"Зарплата = {salary}")
