"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
a = 1 #Объявляю переменную а
b = 2 #Объявляю переменную b

print(a,b) #Вывожу переменные а и b на экран
   
c = int(input ("Введите число ")) #Запрашиваю у пользователя число
print (c) #Вывожу число на экран

d = input ("Введите текст ") #Запрашиваю у пользователя строку
print (d) #Вывожу строку на экран

'''Задачи брал из https://gb.ru/lessons/300073/homework '''