"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

"""
name = str(input('Введите ваше имя: '))
passwd = str(input('Введите ваш пароль: '))
age = int(input('Введите ваш возраст: '))
print(f'Ваши данные для входа в аккаунт: имя - {name}, пароль - {passwd}, возраст - {age}!')