"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
name_car = input("Ведите модель Вашего автомобиля: ")
release_year = input("Ведите год выпуска Вашего автомобиля: ")
num_car = input("Введите номер Вашего автомобиля: ")
print(f"Данные Вашего автомобиля: модель - {name_car}, год - {release_year}, номер - {num_car}")
