"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

first_name = input("Ваше имя: ")
middle_name = input("Ваше отчество: ")
last_name = input("Ваша фамилия: ")
a = last_name + first_name + middle_name
print (a)
