"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

a = int(input("Введите ваш год рождения "))
print(a)

a = int(input("Введите сегодняшнее число "))
print(a)

a = input("Введите свое имя ")
print(a)

a = input("Введите свою фамилию ")
print(a)
