"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
usg = 2023
print(usg)

vnm = 'Первичные данные'
print(vnm)

name = input("Укажите свое имя: ")
years = int(input("Укажите свой возраст: "))
print(f"Имя:  {name},  Возраст:  {years}")