"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
name = input("Как Вас зовут?: ")
city = input("В каком городе проживаете?: ")
star = input("сколько по вашему звузд на небе?: ")
print(f"Уважаемый(-ая) {name}, возможно в г. {city}, {star} звезд, но это точно никому не известно")