"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
# 1 Выполнение домашнего задания. Работа с переменными 

print("Здравствуйте, о Великий мастер Python!!! В целях выполнения домашнего задания\
мне нужно узнать о Вас немного больше информации")
user_name = input("Укажите своё имя: ")
user_pass = input("Придумайте и запиши свой пароль: ")
user_age = input("Уточните Ваш возраст: ")
print(f"Ваши данные для входа в аккаунт: Имя - {user_name}, Пароль - {user_pass}, Возраст - {user_age}. "\
      " А теперь приступаем к следующуему заданию.")


