"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

""""Задани 1"""
user_name = input("имя: ")
passwd = input("пароль: ")
age = input("возраст: ")
print(f"Ваши данные для входа в аккаунт: имя - {user_name},"
      f" пароль - {passwd}, возраст - {age}")
