"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
print("Задание №1")
A = 10
B = 15
print(A, B)
a = input("ВВедите значение а ==> ")
b = input("ВВедите значение b ==> ")
print(f"{A}, {B}")
