"""
Задание 3.

Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn.

Пример:
Введите число n: 3
n + nn + nnn = 369
"""
n = 3
nn = 33
nnn = 333

comp = n + nn + nnn
print("Результат равен: ", comp)
