"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

var_name = input('Введите ваше имя: ')
var_password = input('Ведите ваш пароль: ')
var_age = int(input('Введите ваш возраст: '))

print(f'Ваши данные для входа в аккаунт: имя - {var_name}, пароль - {var_password}, возраст - {var_age}')


