"""
Задание 6.

Спортсмен занимается ежедневными пробежками.
В первый день его результат составил a километров.
Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
Требуется определить номер дня,
на который результат спортсмена составит не менее b километров.
Программа должна принимать значения параметров a и b
 и выводить одно натуральное число — номер дня.

Например: a = 2, b = 3.
Результат:
1-й день: 2
2-й день: 2,2
3-й день: 2,42
4-й день: 2,66
5-й день: 2,93
6-й день: 3,22
Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.
"""

distance = float(input("Please enter your distance, km: "))
finish = float(input("Please enter your finish result, km: "))
count_days = 1
while distance < finish:
    distance = distance * 1.1
    count_days += 1
print("Distance km: ", distance)
print("Count of days: ", count_days)
print(f"On {count_days} day sportsman reach finish {finish} km")



