"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

user_name = input("Ваше имя ")
user_pass = input("Ваш пароль ")
user_age = input("Ваш возраст ")
print("Ваши данные для входа", "Имя:", user_name, "Пароль:", user_pass, "Возраст:", user_age)
