# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

a = 10
b = 'OK'
c = 444.3
d = c != 444.2

print('a =', a, '  type:', type(a))
print('b =', b, '  type:', type(b))
print('c =', c, '  type:', type(c))
print('d =', d, '  type:', type(d))
e = input('Введите e: ')
print('e =', e, '  type:', type(e))

print('______________________')

