a = int(input("Введите число"))
b = (a + a)
c = (a + a + a)

print(str(a) + str(b) + str(c))

"""
Задание 3.

Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn.

Пример:
Введите число n: 3
n + nn + nnn = 369
"""
