# 4. Пользователь вводит целое положительное число. Найдите самую большую# цифру в числе.# Для решения используйте цикл while и арифметические операции.print('task_4\n')n = abs(int(input("Введите целое положительное число: ")))max_num = n % 10while n >= 1:    n = n // 10    if n % 10 > max_num:        max_num = n % 10    if n > 9:        continue    else:        print("Наибольшая цифра в числе ", max_num)        break