"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

first = 10
second = 12
print(first)

second = input("Введите целое число\n")
print(first + int(second))
name = input("Как вас зовут?\n")
prompt = "Вас зовут "
print(prompt + name)
