"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

name = input("\nДобрый день,мяу! Как мне вас называть,мяу?\n")
print(f"\nМяу, {name}, мур-мур\n")

age = input(f"{name} сколько вам лет?\n")
print( f"\nВам {age}? Вы такой взрослый, {name}, мяу :3\n")
