"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

str_var1 = input("Введите ваше имя:")
str_var2 = input("Введите ваш пароль:")
int_var = int(input("Введите ваш возраст:"))
print("Ваши данные для входа в аккаунт: имяva - ", str_var1, ", пароль - ", str_var2, ", возраст - ", int_var)
