"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.
"""

a = 2
b = [1,2,3,4,5,6,7,8,9]
print(a,b)
name = input ("ведите имя")
print(name)
