"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
a = 10
b = 5
print("Переменные a и b - ", a, b)
line1 = input("Введите первую строку: ")
line2 = input("Введите вторую строку: ")
number1 = int(input("Введите первое число: "))
number2 = int(input("Введите второе число: "))
print("Введенные значения: ", line1, line2, number1, number2)