"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

name = input('Enter your name ')
password = input('Enter your password ')
age = int(input('Enter your age '))
print(f'Your account enter information: your name - {name}, '
      f'your password - {password}, your age - {age}')
