"""
Задание 5.

Запросите у пользователя значения выручки и издержек фирмы.
Определите, с каким финансовым результатом работает фирма
(прибыль — выручка больше издержек, или убыток — издержки больше выручки).
Выведите соответствующее сообщение. Если фирма отработала с прибылью,
вычислите рентабельность выручки (соотношение прибыли к выручке).
Далее запросите численность сотрудников фирмы и определите
прибыль фирмы в расчете на одного сотрудника.

Пример:
Введите выручку фирмы: 1000
Введите издержки фирмы: 500
Финансовый результат - прибыль. Ее величина: 500
Значит вычисляем рентабельность выручки (соотношение прибыли к выручке)
Рентабельность выручки = 0.5
Введите численность сотрудников фирмы: 10
Прибыль фирмы в расчете на одного сотрудника = 50.0
"""

revenue = int(input('Enter revenue '))
costs = int(input('Enter costs '))
if revenue > costs:
    profit = revenue - costs
    rent = profit / revenue
    print(f'Profit is {profit}')
    workers = int(input('Enter number of workers '))
    prof_per_worker = profit / workers
    print(f'Profit per worker is {prof_per_worker}')
elif revenue == costs:
    print('Your revenue equals costs')
else:
    print('Your company is in bad situation')
