"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

name = input("Ведите ваше имя : ")
password = input("Ведите ваше пароль : ")
age = input("Ведите ваше возраст : ")
print("=====================================")
print(f" Ваши данные для входа в аккаунт: \n Имя -  {name}\n Пароль - {password}\n Возраст -  {age}")
print("=====================================")
