"""
Задание 3.

Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn.

Пример:
Введите число n: 3
n + nn + nnn = 369
"""
n = int(input("Введите число n: "))
a = str(n)
c1 = a + a2
c2 = a + a + a
b = n + int(c1) + int(c2)
print("Результат равен:", b)