"""
Задание 3.

Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn.

Пример:
Введите число n: 3
n + nn + nnn = 369
"""
number = int(input("Введит целое положительное число: "))
second = number + number
third = second + number
print(f"{number}{second}{third}")