"""
Задание 5.

Запросите у пользователя значения выручки и издержек фирмы.
Определите, с каким финансовым результатом работает фирма
(прибыль — выручка больше издержек, или убыток — издержки больше выручки).
Выведите соответствующее сообщение. Если фирма отработала с прибылью,
вычислите рентабельность выручки (соотношение прибыли к выручке).
Далее запросите численность сотрудников фирмы и определите
прибыль фирмы в расчете на одного сотрудника.

Пример:
Введите выручку фирмы: 1000
Введите издержки фирмы: 500
Финансовый результат - прибыль. Ее величина: 500
Значит вычисляем рентабельность выручки (соотношение прибыли к выручке)
Рентабельность выручки = 0.5
Введите численность сотрудников фирмы: 10
Прибыль фирмы в расчете на одного сотрудника = 50.0
"""

revenue = int(input("Введите выручку фирмы: "))
cost = int(input("Введите издежки фирмы: "))
profitability = int
if revenue > cost:
    profitability = revenue-cost
    print("Компания отработала в прибыль")
    amount_people = int(input("Введите кол-во людей в компании: "))
    profitability = profitability/amount_people
    print(f"Прибыль в фирме на 1 сотрудника = {profitability:.0f}")
else:
    print("Компания отоработала в убыток")
