"""
Задание 3.

Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn.

a = int(input('введите целое положительное число'))
summ_n = a+a**2+a**3
print(summ_n)
