a = (input("Где вы работаете?"))
b = (input("Ваше имя?"))
c = (input("Укажите возраст"))

print("Вы - " + b + "   Ваше место работы - " + a + "   Возраст - " + c)

"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
