"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

a = 8
b = 2
c = a / b
print(c)

name = input("введите ваше имя: ")
wiet = int(input("введите ваш вес: "))
height = int(input("введите ваш рост: "))

print("Данные о клиенте: ", name, wiet, height)
