"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
first_var = 5
second_var = "hello!"
print('Первая переменная:', first_var)
print('Вторая переменная:', second_var)

input_num = int(input('Введите целое число: '))
input_str = input('Введите строку: ')
print('Вы ввели число:', input_num)
print('Вы ввели строку:', input_str)
