"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""
name = 1
age = 1
city = 1
name = input("Введите ваше имя: ")
age = int(input("Введите ваш возраст: "))
city = input("Введите ваш город: ")
print ("Имя:", name)
print ("Возраст:", age)
print ("Город:", city)
