"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.

Пример:
Ведите ваше имя: Василий
Ведите ваш пароль: vas
Введите ваш возраст: 45
Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
"""

var1 = 1
var2 = "test"
print(var1, var2)

var_st = input('Input string:')
var_fl = float(input('Input float number:'))
print(f"{var_st}, {var_fl}")
