"""
5)	Создать (программно) текстовый файл, записать в него программно набор чисел,
 разделенных пробелами. Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.
"""
#!/usr/bin/env python3
import os
print("Внимание, текущая папка:", os.getcwd())

