"""
7)	Создать вручную и заполнить несколькими строками текстовый файл, в котором каждая строка должна содержать данные о фирме: название, форма собственности, выручка, издержки.
Пример строки файла: firm_1   ООО   10000   5000.
Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль. Если фирма получила убытки, в расчет средней прибыли ее не включать.
Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью. Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
Подсказка: использовать менеджер контекста.
"""
import json

res = {}
average_profit = 0
companies = {}
fr = open("file.txt", "r")
for line in fr:
    company, foo, revenue, losses = line.split("\t")
    revenue = int(revenue)
    losses = int(losses)
    profit = revenue - losses
    average_profit += profit if profit > 0 else 0
    companies[company] = profit

res = [companies, {'average_profit': int(average_profit / len([x for x in companies.values() if x >= 0]))}]
print(json.dumps(res))
fr.close(
