"""
Задание 1.

Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init()__),
который должен принимать данные (список списков) для формирования матрицы.
[[], [], []]
Следующий шаг — реализовать перегрузку метода __str()__ для вывода матрицы в привычном виде.

Далее реализовать перегрузку метода __add()__ для реализации операции
сложения двух объектов класса Matrix (двух матриц).
Результатом сложения должна быть новая матрица.

Подсказка: сложение элементов матриц выполнять поэлементно —
первый элемент первой строки первой матрицы складываем
с первым элементом первой строки второй матрицы и т.д.

Пример:
1 2 3
4 5 6
7 8 9

1 2 3
4 5 6
7 8 9

Сумма матриц:
2 4 6
8 10 12
14 16 18
"""
class Matrix:
    def __init__(self, matrix):
        self.matrix = matrix

    def __add__(self, other):
        for first_matrix in range(len(self.matrix)):
            for second_matrix in range(len(self.matrix)):
                self.matrix[first_matrix][second_matrix] = int(self.matrix[first_matrix][second_matrix]) + int(
                    other.matrix[first_matrix][second_matrix])

        return Matrix(self.matrix)

    def __str__(self):
        new_str = [str(first_matrix).strip('[]').replace(',', '') for first_matrix in self.matrix]
        return "\n".join(new_str)


matrix1 = Matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
matrix2 = Matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
print(matrix1 + matrix2)
