"""
Задание 1.

Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init()__),
который должен принимать данные (список списков) для формирования матрицы.
[[], [], []]
Следующий шаг — реализовать перегрузку метода __str()__ для вывода матрицы в привычном виде.

Далее реализовать перегрузку метода __add()__ для реализации операции
сложения двух объектов класса Matrix (двух матриц).
Результатом сложения должна быть новая матрица.

Подсказка: сложение элементов матриц выполнять поэлементно —
первый элемент первой строки первой матрицы складываем
с первым элементом первой строки второй матрицы и т.д.

Пример:
1 2 3
4 5 6
7 8 9

1 2 3
4 5 6
7 8 9

Сумма матриц:
2 4 6
8 10 12
14 16 18
"""


class Matrix:
    def __init__(self, *args):
        self.new_lst = list(args)

    def __str__(self):
        b = str(self.new_lst)
        return b.replace("]", "\n").replace("[", " ").replace(",", "")

    def __add__(self, other):
        new_sum = []
        line_sum = []
        for x in range(len(self.new_lst)):
            for y in range(len(self.new_lst[x])):
                line_sum.append(self.new_lst[x][y] + other.new_lst[x][y])
            new_sum.append(line_sum)
            line_sum = []
        c = str(new_sum)
        return c.replace("]", "\n").replace("[", " ").replace(",", "")



my_m = Matrix([6, 7, 8], [7, 8, 9], [9, 8, 9])
my_m2 = Matrix([6, 7, 8], [7, 8, 9], [9, 8, 9])
print(my_m.__str__())
print(my_m2.__str__())
print(my_m.__add__(my_m2))